console.log('██████╗ ██████╗ \n'+'██╔══██╗██╔══██╗\n'+'██████╔╝██████╔╝\n'+'██╔══██╗██╔══██╗\n'+'██████╔╝██████╔╝\n'+'╚═════╝ ╚═════╝ \n'+"©2021 By bossgeeg123456")


function thtoen(inp){
    var th_all={"ๅ":"1" ,"/":"2" ,"-":"3" ,"ภ":"4" ,"ถ":"5" ,"ุ":"6" ,"ึ":"7" ,"ค":"8" ,"ต":"9" ,"จ":"0" ,"ข":"-" ,"ช":"=" 
    ,"ๆ":"q" ,"ไ":"w" ,"ำ":"e" ,"พ":"r" ,"ะ":"t" ,"ั":"y" ,"ี":"u" ,"ร":"i" ,"น":"o" ,"ย":"p" ,"บ":"[" ,"ล":"]" ,"ฃ":"\\" 
    ,"ฟ":"a" ,"ห":"s" ,"ก":"d" ,"ด":"f" ,"เ":"g" ,"้":"h" ,"่":"j" ,"า":"k" ,"ส":"l" ,"ว":";" ,"ง":"'" ,"ผ":"z" ,"ป":"x" 
    ,"แ":"c" ,"อ":"v" ,"ิ":"b" ,"ื":"n" ,"ท":"m" ,"ม":"," ,"ใ":"." ,"ฝ":"/" 
    ,'+':'!','๑':'@','๒':'#','๓':'$','๔':'%','ู':'^','฿':'&','๕':'*','๖':'(','๗':')','๘':'_','๙':'+'
    ,'๐':'Q','"':'W','ฎ':'E','ฑ':'R','ธ':'T','ํ':'Y','๊':'U','ณ':'I','ฯ':'O','ญ':'P','ฐ':'{',',':'}','ฅ':'|'
    ,'ฤ':'A','ฆ':'S','ฏ':'D','โ':'F','ฌ':'G','็':'H','๋':'J','ษ':'K','ศ':'L','ซ':':','.':'"'
    ,'(':'Z',')':'X','ฉ':'C','ฮ':'V','ฺ':'B','์':'N','?':'M','ฒ':'<','ฬ':'>','ฦ':'?'}

    var text=""
    if(inp[0] in th_all ){
        for(var i=0;i<inp.length;i++){
            if(inp[i] in th_all){
                text+=th_all[inp[i]]
            }
            else{
                text+=inp[i]
            }
        }
    }
    else if(inp.length==0){
        text=""
    }
    else{
        text="Wrong Mode"
    }
    return text
}
function entoth(inp){
    var en_all={"1":"ๅ" ,"2":"/" ,"3":"-" ,"4":"ภ" ,"5":"ถ" ,"6":"ุ" ,"7":"ึ" ,"8":"ค" ,"9":"ต" ,"0":"จ" ,"-":"ข" ,"=":"ช" 
    ,"q":"ๆ" ,"w":"ไ" ,"e":"ำ" ,"r":"พ" ,"t":"ะ" ,"y":"ั" ,"u":"ี" ,"i":"ร" ,"o":"น" ,"p":"ย" ,"[":"บ" ,"]":"ล" ,"\\":"ฃ" 
    ,"a":"ฟ" ,"s":"ห" ,"d":"ก" ,"f":"ด" ,"g":"เ" ,"h":"้" ,"j":"่" ,"k":"า" ,"l":"ส" ,";":"ว" ,"'":"ง" ,"z":"ผ" ,"x":"ป" 
    ,"c":"แ" ,"v":"อ" ,"b":"ิ" ,"n":"ื" ,"m":"ท" ,",":"ม" ,".":"ใ" ,"/":"ฝ"
    ,'!':'+','@':'๑','#':'๒','$':'๓','%':'๔','^':'ู','&':'฿','*':'๕','(':'๖',')':'๗','_':'๘','+':'๙'
    ,'Q':'๐','W':'"','E':'ฎ','R':'ฑ','T':'ธ','Y':'ํ','U':'๊','I':'ณ','O':'ฯ','P':'ญ','{':'ฐ','}':',','|':'ฅ'
    ,'A':'ฤ','S':'ฆ','D':'ฏ','F':'โ','G':'ฌ','H':'็','J':'๋','K':'ษ','L':'ศ',':':'ซ','"':'.'
    ,'Z':'(','X':')','C':'ฉ','V':'ฮ','B':'ฺ','N':'์','M':'?','<':'ฒ','>':'ฬ','?':'ฦ'}

    var text=""
    if(inp[0] in en_all){
        for(var i=0;i<inp.length;i++){
            if(inp[i] in en_all){
                text+=en_all[inp[i]]
            }
            else{
                text+=inp[i]
            }
        }
    }
    else if(inp.length==0){
        text=""
    }
    else{
        text="Wrong Mode"
    }

    return text
}

function autoto(inp){
    var th_all={"ๅ":"1" ,"/":"2" ,"-":"3" ,"ภ":"4" ,"ถ":"5" ,"ุ":"6" ,"ึ":"7" ,"ค":"8" ,"ต":"9" ,"จ":"0" ,"ข":"-" ,"ช":"=" 
    ,"ๆ":"q" ,"ไ":"w" ,"ำ":"e" ,"พ":"r" ,"ะ":"t" ,"ั":"y" ,"ี":"u" ,"ร":"i" ,"น":"o" ,"ย":"p" ,"บ":"[" ,"ล":"]" ,"ฃ":"\\" 
    ,"ฟ":"a" ,"ห":"s" ,"ก":"d" ,"ด":"f" ,"เ":"g" ,"้":"h" ,"่":"j" ,"า":"k" ,"ส":"l" ,"ว":";" ,"ง":"'" ,"ผ":"z" ,"ป":"x" 
    ,"แ":"c" ,"อ":"v" ,"ิ":"b" ,"ื":"n" ,"ท":"m" ,"ม":"," ,"ใ":"." ,"ฝ":"/" 
    ,'+':'!','๑':'@','๒':'#','๓':'$','๔':'%','ู':'^','฿':'&','๕':'*','๖':'(','๗':')','๘':'_','๙':'+'
    ,'๐':'Q','"':'W','ฎ':'E','ฑ':'R','ธ':'T','ํ':'Y','๊':'U','ณ':'I','ฯ':'O','ญ':'P','ฐ':'{',',':'}','ฅ':'|'
    ,'ฤ':'A','ฆ':'S','ฏ':'D','โ':'F','ฌ':'G','็':'H','๋':'J','ษ':'K','ศ':'L','ซ':':','.':'"'
    ,'(':'Z',')':'X','ฉ':'C','ฮ':'V','ฺ':'B','์':'N','?':'M','ฒ':'<','ฬ':'>','ฦ':'?'}

    var en_all={"1":"ๅ" ,"2":"/" ,"3":"-" ,"4":"ภ" ,"5":"ถ" ,"6":"ุ" ,"7":"ึ" ,"8":"ค" ,"9":"ต" ,"0":"จ" ,"-":"ข" ,"=":"ช" 
    ,"q":"ๆ" ,"w":"ไ" ,"e":"ำ" ,"r":"พ" ,"t":"ะ" ,"y":"ั" ,"u":"ี" ,"i":"ร" ,"o":"น" ,"p":"ย" ,"[":"บ" ,"]":"ล" ,"\\":"ฃ" 
    ,"a":"ฟ" ,"s":"ห" ,"d":"ก" ,"f":"ด" ,"g":"เ" ,"h":"้" ,"j":"่" ,"k":"า" ,"l":"ส" ,";":"ว" ,"'":"ง" ,"z":"ผ" ,"x":"ป" 
    ,"c":"แ" ,"v":"อ" ,"b":"ิ" ,"n":"ื" ,"m":"ท" ,",":"ม" ,".":"ใ" ,"/":"ฝ"
    ,'!':'+','@':'๑','#':'๒','$':'๓','%':'๔','^':'ู','&':'฿','*':'๕','(':'๖',')':'๗','_':'๘','+':'๙'
    ,'Q':'๐','W':'"','E':'ฎ','R':'ฑ','T':'ธ','Y':'ํ','U':'๊','I':'ณ','O':'ฯ','P':'ญ','{':'ฐ','}':',','|':'ฅ'
    ,'A':'ฤ','S':'ฆ','D':'ฏ','F':'โ','G':'ฌ','H':'็','J':'๋','K':'ษ','L':'ศ',':':'ซ','"':'.'
    ,'Z':'(','X':')','C':'ฉ','V':'ฮ','B':'ฺ','N':'์','M':'?','<':'ฒ','>':'ฬ','?':'ฦ'}

    var text=""
    for(var i=0;i<inp.length;i++){

        if(inp[i] in th_all && inp[i] in en_all ){
            if(inp.length>1){
                if(navigator.language!="th"){
                    text+=th_all[inp[i]]
                }
                else{
                    text+=en_all[inp[i]]
                }
            }
            else{
                if(inp[i-1] in th_all){
                    text+=th_all[inp[i]]
                }
                else if(inp[i-1] in en_all){
                    text+=en_all[inp[i]]
                }
                else{
                    text+=inp[i]
                }
            }
        }

        else if(inp[i] in th_all){
            text+=th_all[inp[i]]
        }

        else if(inp[i] in en_all){
            text+=en_all[inp[i]]
        }

        else{
            text+=inp[i]
        }
    }

    return text

}

function system_main(){
    
    var sel=document.getElementById("me_c")
    var inp=document.getElementById("inp")
    var outp=document.getElementById("outp")
    
    if(sel.value=="Th To En"){
        outp.value=thtoen(inp.value)
    }
    else if(sel.value=="En To Th"){
        outp.value=entoth(inp.value)
    }
    else if(sel.value=="Auto"){
        outp.value=autoto(inp.value)
    }

    setcookie()
}
